CSI API ETABS v1
cDesignShearWall.GetPierSummaryResults Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetPierSummaryResults(
	ref string[] Story,
	ref string[] PierLabel,
	ref string[] Station,
	ref string[] DesignType,
	ref string[] PierSecType,
	ref string[] EdgeBar,
	ref string[] EndBar,
	ref double[] BarSpacing,
	ref double[] ReinfPercent,
	ref double[] CurrPercent,
	ref double[] DCRatio,
	ref string[] PierLeg,
	ref double[] LegX1,
	ref double[] LegY1,
	ref double[] LegX2,
	ref double[] LegY2,
	ref double[] EdgeLeft,
	ref double[] EdgeRight,
	ref double[] AsLeft,
	ref double[] AsRight,
	ref double[] ShearAv,
	ref double[] StressCompLeft,
	ref double[] StressCompRight,
	ref double[] StressLimitLeft,
	ref double[] StressLimitRight,
	ref double[] CDepthLeft,
	ref double[] CLimitLeft,
	ref double[] CDepthRight,
	ref double[] CLimitRight,
	ref double[] InelasticRotDemand,
	ref double[] InelasticRotCapacity,
	ref double[] NormCompStress,
	ref double[] NormCompStressLimit,
	ref double[] CDepth,
	ref double[] BZoneL,
	ref double[] BZoneR,
	ref double[] BZoneLength,
	ref string[] WarnMsg,
	ref string[] ErrMsg
)
Function GetPierSummaryResults (
	ByRef Story As String(),
	ByRef PierLabel As String(),
	ByRef Station As String(),
	ByRef DesignType As String(),
	ByRef PierSecType As String(),
	ByRef EdgeBar As String(),
	ByRef EndBar As String(),
	ByRef BarSpacing As Double(),
	ByRef ReinfPercent As Double(),
	ByRef CurrPercent As Double(),
	ByRef DCRatio As Double(),
	ByRef PierLeg As String(),
	ByRef LegX1 As Double(),
	ByRef LegY1 As Double(),
	ByRef LegX2 As Double(),
	ByRef LegY2 As Double(),
	ByRef EdgeLeft As Double(),
	ByRef EdgeRight As Double(),
	ByRef AsLeft As Double(),
	ByRef AsRight As Double(),
	ByRef ShearAv As Double(),
	ByRef StressCompLeft As Double(),
	ByRef StressCompRight As Double(),
	ByRef StressLimitLeft As Double(),
	ByRef StressLimitRight As Double(),
	ByRef CDepthLeft As Double(),
	ByRef CLimitLeft As Double(),
	ByRef CDepthRight As Double(),
	ByRef CLimitRight As Double(),
	ByRef InelasticRotDemand As Double(),
	ByRef InelasticRotCapacity As Double(),
	ByRef NormCompStress As Double(),
	ByRef NormCompStressLimit As Double(),
	ByRef CDepth As Double(),
	ByRef BZoneL As Double(),
	ByRef BZoneR As Double(),
	ByRef BZoneLength As Double(),
	ByRef WarnMsg As String(),
	ByRef ErrMsg As String()
) As Integer
Dim instance As cDesignShearWall
Dim Story As String()
Dim PierLabel As String()
Dim Station As String()
Dim DesignType As String()
Dim PierSecType As String()
Dim EdgeBar As String()
Dim EndBar As String()
Dim BarSpacing As Double()
Dim ReinfPercent As Double()
Dim CurrPercent As Double()
Dim DCRatio As Double()
Dim PierLeg As String()
Dim LegX1 As Double()
Dim LegY1 As Double()
Dim LegX2 As Double()
Dim LegY2 As Double()
Dim EdgeLeft As Double()
Dim EdgeRight As Double()
Dim AsLeft As Double()
Dim AsRight As Double()
Dim ShearAv As Double()
Dim StressCompLeft As Double()
Dim StressCompRight As Double()
Dim StressLimitLeft As Double()
Dim StressLimitRight As Double()
Dim CDepthLeft As Double()
Dim CLimitLeft As Double()
Dim CDepthRight As Double()
Dim CLimitRight As Double()
Dim InelasticRotDemand As Double()
Dim InelasticRotCapacity As Double()
Dim NormCompStress As Double()
Dim NormCompStressLimit As Double()
Dim CDepth As Double()
Dim BZoneL As Double()
Dim BZoneR As Double()
Dim BZoneLength As Double()
Dim WarnMsg As String()
Dim ErrMsg As String()
Dim returnValue As Integer
returnValue = instance.GetPierSummaryResults(Story,
	PierLabel, Station, DesignType, PierSecType,
	EdgeBar, EndBar, BarSpacing, ReinfPercent,
	CurrPercent, DCRatio, PierLeg, LegX1,
	LegY1, LegX2, LegY2, EdgeLeft, EdgeRight,
	AsLeft, AsRight, ShearAv, StressCompLeft,
	StressCompRight, StressLimitLeft,
	StressLimitRight, CDepthLeft, CLimitLeft,
	CDepthRight, CLimitRight, InelasticRotDemand,
	InelasticRotCapacity, NormCompStress,
	NormCompStressLimit, CDepth, BZoneL,
	BZoneR, BZoneLength, WarnMsg, ErrMsg)
int GetPierSummaryResults(
	array<String^>^% Story,
	array<String^>^% PierLabel,
	array<String^>^% Station,
	array<String^>^% DesignType,
	array<String^>^% PierSecType,
	array<String^>^% EdgeBar,
	array<String^>^% EndBar,
	array<double>^% BarSpacing,
	array<double>^% ReinfPercent,
	array<double>^% CurrPercent,
	array<double>^% DCRatio,
	array<String^>^% PierLeg,
	array<double>^% LegX1,
	array<double>^% LegY1,
	array<double>^% LegX2,
	array<double>^% LegY2,
	array<double>^% EdgeLeft,
	array<double>^% EdgeRight,
	array<double>^% AsLeft,
	array<double>^% AsRight,
	array<double>^% ShearAv,
	array<double>^% StressCompLeft,
	array<double>^% StressCompRight,
	array<double>^% StressLimitLeft,
	array<double>^% StressLimitRight,
	array<double>^% CDepthLeft,
	array<double>^% CLimitLeft,
	array<double>^% CDepthRight,
	array<double>^% CLimitRight,
	array<double>^% InelasticRotDemand,
	array<double>^% InelasticRotCapacity,
	array<double>^% NormCompStress,
	array<double>^% NormCompStressLimit,
	array<double>^% CDepth,
	array<double>^% BZoneL,
	array<double>^% BZoneR,
	array<double>^% BZoneLength,
	array<String^>^% WarnMsg,
	array<String^>^% ErrMsg
)
abstract GetPierSummaryResults :
        Story : string[] byref *
        PierLabel : string[] byref *
        Station : string[] byref *
        DesignType : string[] byref *
        PierSecType : string[] byref *
        EdgeBar : string[] byref *
        EndBar : string[] byref *
        BarSpacing : float[] byref *
        ReinfPercent : float[] byref *
        CurrPercent : float[] byref *
        DCRatio : float[] byref *
        PierLeg : string[] byref *
        LegX1 : float[] byref *
        LegY1 : float[] byref *
        LegX2 : float[] byref *
        LegY2 : float[] byref *
        EdgeLeft : float[] byref *
        EdgeRight : float[] byref *
        AsLeft : float[] byref *
        AsRight : float[] byref *
        ShearAv : float[] byref *
        StressCompLeft : float[] byref *
        StressCompRight : float[] byref *
        StressLimitLeft : float[] byref *
        StressLimitRight : float[] byref *
        CDepthLeft : float[] byref *
        CLimitLeft : float[] byref *
        CDepthRight : float[] byref *
        CLimitRight : float[] byref *
        InelasticRotDemand : float[] byref *
        InelasticRotCapacity : float[] byref *
        NormCompStress : float[] byref *
        NormCompStressLimit : float[] byref *
        CDepth : float[] byref *
        BZoneL : float[] byref *
        BZoneR : float[] byref *
        BZoneLength : float[] byref *
        WarnMsg : string[] byref *
        ErrMsg : string[] byref -> int
Parameters
Story
Type: System.String[]
PierLabel
Type: System.String[]
Station
Type: System.String[]
DesignType
Type: System.String[]
PierSecType
Type: System.String[]
EdgeBar
Type: System.String[]
EndBar
Type: System.String[]
BarSpacing
Type: System.Double[]
ReinfPercent
Type: System.Double[]
CurrPercent
Type: System.Double[]
DCRatio
Type: System.Double[]
PierLeg
Type: System.String[]
LegX1
Type: System.Double[]
LegY1
Type: System.Double[]
LegX2
Type: System.Double[]
LegY2
Type: System.Double[]
EdgeLeft
Type: System.Double[]
EdgeRight
Type: System.Double[]
AsLeft
Type: System.Double[]
AsRight
Type: System.Double[]
ShearAv
Type: System.Double[]
StressCompLeft
Type: System.Double[]
StressCompRight
Type: System.Double[]
StressLimitLeft
Type: System.Double[]
StressLimitRight
Type: System.Double[]
CDepthLeft
Type: System.Double[]
CLimitLeft
Type: System.Double[]
CDepthRight
Type: System.Double[]
CLimitRight
Type: System.Double[]
InelasticRotDemand
Type: System.Double[]
InelasticRotCapacity
Type: System.Double[]
NormCompStress
Type: System.Double[]
NormCompStressLimit
Type: System.Double[]
CDepth
Type: System.Double[]
BZoneL
Type: System.Double[]
BZoneR
Type: System.Double[]
BZoneLength
Type: System.Double[]
WarnMsg
Type: System.String[]
ErrMsg
Type: System.String[]
Return Value
Type: Int32
See Also
Reference
cDesignShearWall Interface
ETABSv1 Namespace